#+begin_src sh :results output
cd signatures && ls *.go | grep -v api | grep -v networking | sed "s/.go$$//g" | tr '\n' ' '

#+end_src

#+RESULTS:
: apache.go golang.go haproxy.go java.go nginx.go nodejs.go postgresql.go


http://techblog.netflix.com/2015/11/linux-performance-analysis-in-60s.html

* Feedback

http://unix.stackexchange.com/questions/144812/generate-consistent-machine-unique-id

=-feedback= flag on the os.Arg[0].

This will send the following anonymous information back to Fugue:

#+begin_src json
{
"memory": "512mb",
"swap": "true",
"cpus": 3,
"gpus": 0",
"network": 1,
"kernel": "uname -a"
"sysctl": { }
}
#+end_src

FAQ?

What is Feedback?

We want to make Autotune better and give you better performance. As
such we will gather the following information. <<CODE>

You are always welcome to disable Feedback by running autotune with
-feedback=false or setting the environment variable
AUTOTUNE_FEEDBACK=false.


~Machine Signature~

#+begin_src golang

func cpuId() string {
    "sudo dmidecode -t 4 | grep ID | sed 's/.*ID://;s/ //g'"
}

func ethId() string {
    "$(ifconfig | grep eth1 | awk '{print $NF}' | sed 's/://g')"
}

func machineId() {
return crypto.Sum256(cpuId() + ethId())
}

        | sha256sum |
  awk '{print $1}'
#+end_src
59603d5e9957c23e7099c80bf137db19144cbb24efeeadfbd090f89a5f64041f
